<a href="https://colab.research.google.com/github/cjvilla/Gold-Projections/blob/main/Code/random_forests.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [5]:
data = pd.read_csv('/content/drive/MyDrive/Gold-Projections/celine-work/datetime_gold_predictions.csv')
data = data.drop(columns=['Unnamed: 0'])
data.head()

      Date  Inflation_Value  ...  south_african_rand  australian_dollar
0  01/1979              9.3  ...          197.018182         198.600000
1  02/1979              9.9  ...          209.860000         216.650000
2  03/1979             10.1  ...          204.359091         215.945455
3  04/1979             10.5  ...          202.347619         215.414286
4  05/1979             10.9  ...          217.695652         233.165217

[5 rows x 8 columns]